<a href="https://colab.research.google.com/github/aqilaazza/mini-bootcamp-data-analyst-python/blob/main/03-series/series-training.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Latihan struktur Dasar Series

1. Import Libraru Pandas

In [2]:
import pandas as pd

2. Buatkan series seperti pada solusi dibawah

In [7]:
arr =[10,20, 30, 40, 50]
ser_arr = pd.Series(arr)
ser_arr

0    10
1    20
2    30
3    40
4    50
dtype: int64

3. Lakukan slicing untuk mendapatkan hasil berikut

In [8]:
ser_arr[2:4]

2    30
3    40
dtype: int64

4. Lakukan Operasi Matematika pada Series s hingga menghasilkan output berikut

In [9]:
ser_arr / 10

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

5. Gunakan method/fungsi series untuk mendapatkan standar devisiasinya

In [16]:
ser_arr.std()

15.811388300841896